### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_dynamodb_table.this will be created
+   resource "aws_dynamodb_table" "this" {
+       arn              = (known after apply)
+       billing_mode     = "PROVISIONED"
+       hash_key         = "LockID"
+       id               = (known after apply)
+       name             = "terraform_state"
+       read_capacity    = 1
+       stream_arn       = (known after apply)
+       stream_label     = (known after apply)
+       stream_view_type = (known after apply)
+       tags             = {
+           "Name" = "DynamoDB Terraform State Lock Table"
        }
+       tags_all         = {
+           "ManagedBy" = "Terraformer"
+           "Name"      = "DynamoDB Terraform State Lock Table"
        }
+       write_capacity   = 1

+       attribute {
+           name = "LockID"
+           type = "S"
        }

+       point_in_time_recovery {
+           enabled = (known after apply)
        }

+       server_side_encryption {
+           enabled     = (known after apply)
+           kms_key_arn = (known after apply)
        }
    }

  # aws_s3_bucket.this will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = "private"
+       arn                         = (known after apply)
+       bucket                      = "kiririmode-tfbackend"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Name" = "S3 Remote Terraform State Store"
        }
+       tags_all                    = {
+           "ManagedBy" = "Terraformer"
+           "Name"      = "S3 Remote Terraform State Store"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       object_lock_configuration {
+           object_lock_enabled = "Enabled"
        }

+       server_side_encryption_configuration {
+           rule {
+               apply_server_side_encryption_by_default {
+                   sse_algorithm = "AES256"
                }
            }
        }

+       versioning {
+           enabled    = true
+           mfa_delete = false
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>